# GetAssociatedLevel Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LevelAssociationData..::..GetAssociatedLevel Method
LevelAssociationData Class See Also
---
Returns the Associated Level id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ElementId GetAssociatedLevel()
```

Visual Basic
---
```text
Public Function GetAssociatedLevel As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetAssociatedLevel()
```

# See Also
LevelAssociationData Class
Autodesk.Revit.DB Namespace